/*-----------------------------------------------
  Ãû³Æ£ºÒôÀÖ²¥·Å
  ÂÛÌ³£ºwww.doflye.net
  ±àĞ´£ºshifang
  ÈÕÆÚ£º2009.5
  ĞŞ¸Ä£ºÎŞ
  ÄÚÈİ£º
------------------------------------------------*/
#include<reg52.h>        //°üº¬Í·ÎÄ¼ş£¬Ò»°ãÇé¿ö²»ĞèÒª¸Ä¶¯£
                         //Í·ÎÄ¼ş°üº¬ÌØÊâ¹¦ÄÜ¼Ä´æÆ÷µÄ¶¨Òå
/*------------------------------------------------
                 Ó²¼ş¶Ë¿Ú¶¨Òå
------------------------------------------------*/
sbit      SPK=P1^2;  //¶¨ÒåÒôÀÖÊä³ö¶Ë¿Ú

unsigned char Timer0_H,Timer0_L,Time;
                         //ÊÀÉÏÖ»ÓĞÂèÂèºÃÊı¾İ±í
code unsigned char MUSIC[]={          6,2,3,      5,2,1,      3,2,2,    5,2,2,    1,3,2,    6,2,1,    5,2,1,
                                      6,2,4,      3,2,2,      5,2,1,    6,2,1, 	  5,2,2, 	3,2,2, 	  1,2,1,
                                      6,1,1,      5,2,1,      3,2,1, 	2,2,4, 	  2,2,3, 	3,2,1,    5,2,2,
                                      5,2,1,      6,2,1,      3,2,2, 	2,2,2,    1,2,4, 	5,2,3, 	  3,2,1,
                                      2,2,1,      1,2,1,      6,1,1, 	1,2,1, 	  5,1,6, 	0,0,0 
                                      };
                         // Òô½×ÆµÂÊ±í ¸ß°ËÎ»
code unsigned char FREQH[]={
                                0xF2,0xF3,0xF5,0xF5,0xF6,0xF7,0xF8, 
                                0xF9,0xF9,0xFA,0xFA,0xFB,0xFB,0xFC,0xFC, //1,2,3,4,5,6,7,8,i
                                0xFC,0xFD,0xFD,0xFD,0xFD,0xFE,
                                0xFE,0xFE,0xFE,0xFE,0xFE,0xFE,0xFF,
                               } ;
                         // Òô½×ÆµÂÊ±í µÍ°ËÎ»
code unsigned char FREQL[]={
                                 0x42,0xC1,0x17,0xB6,0xD0,0xD1,0xB6,
                                 0x21,0xE1,0x8C,0xD8,0x68,0xE9,0x5B,0x8F, //1,2,3,4,5,6,7,8,i
                                 0xEE,0x44, 0x6B,0xB4,0xF4,0x2D, 
                                 0x47,0x77,0xA2,0xB6,0xDA,0xFA,0x16,
                                };
/*------------------------------------------------
 uSÑÓÊ±º¯Êı£¬º¬ÓĞÊäÈë²ÎÊı unsigned char t£¬ÎŞ·µ»ØÖµ
 unsigned char ÊÇ¶¨ÒåÎŞ·ûºÅ×Ö·û±äÁ¿£¬ÆäÖµµÄ·¶Î§ÊÇ
 0~255 ÕâÀïÊ¹ÓÃ¾§Õñ12M£¬¾«È·ÑÓÊ±ÇëÊ¹ÓÃ»ã±à,´óÖÂÑÓÊ±
 ³¤¶ÈÈçÏÂ T=tx2+5 uS 
------------------------------------------------*/
void DelayUs2x(unsigned char t)
{   
 while(--t);
}
/*------------------------------------------------
 mSÑÓÊ±º¯Êı£¬º¬ÓĞÊäÈë²ÎÊı unsigned char t£¬ÎŞ·µ»ØÖµ
 unsigned char ÊÇ¶¨ÒåÎŞ·ûºÅ×Ö·û±äÁ¿£¬ÆäÖµµÄ·¶Î§ÊÇ
 0~255 ÕâÀïÊ¹ÓÃ¾§Õñ12M£¬¾«È·ÑÓÊ±ÇëÊ¹ÓÃ»ã±à
------------------------------------------------*/
void DelayMs(unsigned char t)
{
     
 while(t--)
 {
     //´óÖÂÑÓÊ±1mS
     DelayUs2x(245);
	 DelayUs2x(245);
 }
}
/*------------------------------------------------
                ½ÚÅÄÑÓÊ±º¯Êı
 ¸÷µ÷1/4½ÚÅÄÊ±¼ä£º
 µ÷4/4  125ms
 µ÷2/4  250ms
 µ÷3/4  187ms
------------------------------------------------*/
void delay(unsigned char t)
{
    unsigned char i;
	for(i=0;i<t;i++)
	    DelayMs(250);
    TR0=0;
 }
/*------------------------------------------------
               ¶¨Ê±Æ÷0ÖĞ¶Ï
------------------------------------------------*/
void TIM0_ISR() interrupt 1
{
 TR0=0;      
 SPK=!SPK;
 TH0=Timer0_H;
 TL0=Timer0_L;
 TR0=1;
 }
/*------------------------------------------------
                ¸èÇú´¦Àíº¯Êı
------------------------------------------------*/
void Song()
{
 TH0=Timer0_H;//¸³Öµ¶¨Ê±Æ÷Ê±¼ä£¬¾ö¶¨ÆµÂÊ
 TL0=Timer0_L;
 TR0=1;       //´ò¿ª¶¨Ê±Æ÷
 delay(Time); //ÑÓÊ±ËùĞèÒªµÄ½ÚÅÄ                      
 }
/*------------------------------------------------
                Ö÷º¯Êı
------------------------------------------------*/
 void main(void)
 {
 unsigned char k,i;
 TMOD|=0x01; //ÖÃ¶¨Ê±Æ÷0¹¤×÷·½Ê½1
 EA=1;       //´ò¿ªÈ«¾ÖÖĞ¶Ï
 ET0=1;      //´ò¿ª¶¨Ê±0ÖĞ¶Ï
 while(1)
      {
       i=0;  
       while(i<100)
	        {         //ÒôÀÖÊı×é³¤¶È £¬³ªÍê´ÓÍ·ÔÙÀ´        
            k=MUSIC[i]+7*MUSIC[i+1]-1;//È¥Òô·ûÕñµ´ÆµÂÊËùĞèÊı¾İ
            Timer0_H=FREQH[k];
            Timer0_L=FREQL[k];
            Time=MUSIC[i+2];          //½ÚÅÄÊ±³¤
            i=i+3;
            Song();
           }
       } 
  }