/*-----------------------------------------------
  名称：计数器1
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：通过外部按键计数进入中断执行LED取反
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义

sbit LED=P1^2;    //定义LED端口

/*------------------------------------------------
                    定时器初始化子程序
------------------------------------------------*/
void Init_Timer1(void)
{
 TMOD |= 0x10 | 0x40;	  //使用模式1，16位计数器，使用"|"符号可以在使用多个定时器时不受影响		     
 TH1=0xFF;	      //给定初值
 TL1=245;         //从245计数到255 
 EA=1;            //总中断打开
 ET1=1;           //定时器中断打开
 TR1=1;           //定时器开关打开
}
/*------------------------------------------------
                    主程序
------------------------------------------------*/
main()
{
 Init_Timer1();
 while(1);
}

/*------------------------------------------------
                 定时器中断子程序
------------------------------------------------*/
void Timer1_isr(void) interrupt 3 
{
 TH1=0xFF;	      //重新给定初值
 TL1=245; 

 LED=~LED;        //指示灯反相，可以看到闪烁

}