/*-----------------------------------------------
  名称：矩阵键盘头文件
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：
------------------------------------------------*/
#ifndef __KEYBOARD_H__
#define __KEYBOARD_H__

/*------------------------------------------------
按键扫描函数，返回扫描键值
------------------------------------------------*/
unsigned char KeyScan(void);  //键盘扫描函数，使用行列反转扫描法

/*------------------------------------------------
按键值处理函数，返回扫键值
------------------------------------------------*/
unsigned char KeyPro(void);

#endif

