/*-----------------------------------------------
  名称：8位数码管显示其中之一
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：显示8位数码管中任意一位
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义

#define DataPort P0 //定义数据端口 程序中遇到DataPort 则用P0 替换
sbit LATCH1=P2^2;//定义锁存使能端口 段锁存
sbit LATCH2=P2^3;//                 位锁存

/*------------------------------------------------
                    主函数
------------------------------------------------*/
main()
{

 while(1)
      {
	   DataPort=0xfe; //取位码 第一位数码管选通，即二进制1111 1110
       LATCH2=1;     //位锁存
       LATCH2=0;

       DataPort=0x4F; //取显示数据，段码 “3”共阴字符码
       LATCH1=1;     //段锁存
       LATCH1=0;
      }
}
