/*-----------------------------------------------
  名称：红外发射原理
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：通过红外发射接收闪烁LED，同普通LED显示程序相同。
  间歇发送38K调制波形。发射J34（IR2）端子接P3.3，J27（任意端子）接P3.2,
  P1.3接任意LED，正常情况LED闪烁，拔掉发射或者接收信号线，led熄灭。
------------------------------------------------*/
#include<reg52.h>     //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义
#include<INTRINS.H>


sbit LED=P3^3;        //红外发射
sbit LED1=P1^3;
sbit IR=P3^2;         //红外一体化接收

bit Flag;

void Init_Timer0(void)
{
 TMOD |= 0x01;			     
 TH0=0xf0;	              	//定时器值初始化
 TL0=0x00;
 EA=1;                      //打开中断
 ET0=1;                     
 TR0=1;  
}


/*-----------------------------------------------
				定时器初始化
------------------------------------------------*/
void Timer0_isr(void) interrupt 1 using 1
{
 TH0=0x0f;		//重新赋值
 TL0=0x00;
 Flag=!Flag;
}

/*-----------------------------------------------
				主函数
------------------------------------------------*/
main()
{

 //unsigned int j;
 Init_Timer0();    //定时器初始化

 while(1)
 {

    LED1=IR;       //读取一体化接收头数值
	while(Flag)	   //循环取反频率大约38K
	   {
		   _nop_();
		   _nop_();
		   _nop_();
		   _nop_();
		   _nop_();
		   _nop_();
		   _nop_();
		   _nop_();
		   _nop_();
		   LED=!LED;    //发射管输出	    
	    }
   }
}
