#define s ((((((((0
#define x )*2+1
#define _ )*2

 unsigned char code Font8x8[][8]={
s _ x x x x x x x ,// START1
s x x _ _ _ x _ _ ,
s x x _ x x x x _ ,
s x x _ _ _ x x _ ,
s x x x x _ x x _ ,
s x x _ _ _ x x _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x x x ,// START2
s _ x _ _ _ x _ _ ,
s x x _ x _ x _ x ,
s x x _ _ _ x _ _ ,
s x x _ x _ x _ _ ,
s x x _ x _ x _ x ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x _ _ ,// START3
s _ x _ _ _ x x _ ,
s _ x x _ x x x _ ,
s _ x x _ x x x _ ,
s x x x _ x x x _ ,
s _ x x _ x x x _ ,
s x x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// STOP1
s x x x x _ _ _ x ,
s x x x x _ x x x ,
s x x x x _ _ _ x ,
s x x x x x x _ x ,
s x x x x _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x x x ,// STOP2
s _ _ _ x _ _ _ x ,
s x _ x x _ x _ x ,
s x _ x x _ x _ x ,
s x _ x x _ x _ x ,
s x _ x x _ _ _ x ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x _ _ ,// STOP3
s _ _ _ x x x x _ ,
s _ x _ x x x x _ ,
s _ _ _ x x x x _ ,
s _ x x x x x x _ ,
s _ x x x x x x _ ,
s x x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// TIMER1
s x x _ _ _ x _ x ,
s x x x _ x x _ x ,
s x x x _ x x _ x ,
s x x x _ x x _ x ,
s x x x _ x x _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x x x ,// TIMER2
s _ x x x _ x _ _ ,
s _ _ x _ _ x _ x ,
s _ x _ x _ x _ _ ,
s _ x x x _ x _ x ,
s _ x x x _ x _ _ ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x _ _ ,// TIMER3
s _ x _ _ _ x x _ ,
s x x _ x _ x x _ ,
s _ x _ _ _ x x _ ,
s x x _ _ x x x _ ,
s _ x _ x _ x x _ ,
s x x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// ON1
s x x x x _ _ _ x ,
s x x x x _ x _ x ,
s x x x x _ x _ x ,
s x x x x _ x _ x ,
s x x x x _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x _ _ ,// ON2
s _ x x _ x x x _ ,
s _ _ x _ x x x _ ,
s _ x _ _ x x x _ ,
s _ x x _ x x x _ ,
s _ x x _ x x x _ ,
s x x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// OFF1
s x x _ _ _ x _ _ ,
s x x _ x _ x _ x ,
s x x _ x _ x _ _ ,
s x x _ x _ x _ x ,
s x x _ _ _ x _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x _ _ ,// OFF2
s _ x _ _ _ x x _ ,
s x x _ x x x x _ ,
s _ x _ _ _ x x _ ,
s x x _ x x x x _ ,
s x x _ x x x x _ ,
s x x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// êl
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s x x x _ _ _ _ _ ,
s x x x _ _ _ _ _ ,
s x x x _ _ _ _ _ ,

s _ _ _ x x _ _ _ ,// UFO
s _ _ x x x x _ _ ,
s _ _ x x x x _ _ ,
s x x x x x x x x ,
s _ x x x x x x _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// ÉxÉã
s _ _ _ x x x _ _ ,
s _ _ x _ _ _ x _ ,
s _ _ x _ _ _ x _ ,
s _ _ x x _ x x _ ,
s _ x _ _ x _ _ x ,
s _ _ x _ _ _ x _ ,
s _ _ _ x x x _ _ ,

s _ x _ _ x x x _ ,// Åé
s x _ x x _ _ _ x ,
s _ x _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ x ,
s _ _ _ _ x x x _ ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x x x ,// Å§
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x x x ,// Å•
s _ x x x x x x _ ,
s _ x x x x x x _ ,
s _ _ x x x x _ _ ,
s _ _ x x x x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,//Å¢
s _ _ _ x x _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s x x x x x x x x ,

s _ _ _ _ _ _ _ _ ,//Å£
s _ _ _ x x _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ x x x x _ _ ,
s _ _ x x x x _ _ ,
s _ x x x x x x _ ,
s _ x x x x x x _ ,
s x x x x x x x x ,

s _ _ _ _ _ _ _ x ,// Å^
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s x _ _ _ _ _ _ _ ,

s x _ _ _ _ _ _ _ ,// Å_
s _ x _ _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ _ x ,

s _ x _ _ _ _ x _ ,// åé
s _ x x x x x x _ ,
s _ x _ x x _ x _ ,
s _ _ _ x x _ _ _ ,
s x _ x x x x _ x ,
s x x x x x x x x ,
s x _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ x _ ,// ƒÍ
s _ _ x x x x x x ,
s _ x _ _ _ _ x _ ,
s _ _ _ x x x x _ ,
s _ _ _ x _ _ x _ ,
s _ _ x x x x x x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,

s _ _ _ x x _ _ _ ,// ∑÷
s _ _ x _ _ x _ _ ,
s _ x _ _ _ _ x _ ,
s x _ x x x x _ x ,
s _ _ _ x _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ x _ _ x _ _ _ ,
s _ _ _ x x _ _ _ ,

s _ x x x _ _ x _ ,// √Î
s _ _ x _ _ _ x _ ,
s x x x x _ x x _ ,
s _ _ x _ _ x x x ,
s _ x x x _ x x x ,
s x _ x _ _ _ x x ,
s _ _ x _ _ _ x _ ,
s _ _ x _ _ x _ _ ,

s _ _ _ _ _ _ _ _ ,// ‘¬
s _ x x x x x x x ,
s _ x _ _ x _ _ x ,
s _ x _ _ x _ _ x ,
s _ x x x x x x x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Å®
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s _ x x x x x x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Å©
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x x x x x x _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Å™
s _ _ x x x _ _ _ ,
s _ x _ x _ x _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Å´
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ x _ x _ x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// SPACE
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// !
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ x _ _ _ ,// "
s _ _ x _ x _ _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ x _ _ ,// x
s _ x x x x x x _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ x x x x x x _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// $
s _ _ x x x x _ _ ,
s _ x _ x _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ x _ x _ _ ,
s _ x x x x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ x _ ,// %
s _ x _ x _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ x _ ,
s _ _ _ x _ x _ x ,
s _ _ x _ _ _ x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ _ _ ,// &
s _ x _ x _ _ _ _ ,
s _ x _ x _ _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ x _ _ x _ x _ ,
s _ x _ _ _ x _ _ ,
s _ _ x x x _ x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// '
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// (
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ _ _ ,// )
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// *
s _ _ x _ x _ x _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x x x _ _ ,
s _ _ x _ x _ x _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// +
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ x x x x x _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// -
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// .
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ x ,// SLASH
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// 0(ZERO)
s _ x _ _ _ _ x x ,
s _ x _ _ _ x _ x ,
s _ x _ _ x _ _ x ,
s _ x _ x _ _ _ x ,
s _ x x _ _ _ _ x ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// 1
s _ _ _ x x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x _ _ ,// 2
s _ x _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ x x x _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x _ _ ,// 3
s _ x _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// 4
s _ _ _ x x _ _ _ ,
s _ _ x _ x _ _ _ ,
s _ x _ _ x _ _ _ ,
s _ x _ _ x _ _ _ ,
s _ x x x x x x _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// 5
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x _ _ ,// 6
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// 7
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x _ _ ,// 8
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ _ ,
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x _ _ ,// 9
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// :
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ;
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ x _ _ ,// <
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// =
s _ _ _ _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ _ _ ,// >
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x x _ _ ,// ?
s _ _ x _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x x _ _ ,// @
s _ _ x _ _ _ x _ ,
s _ x _ x x x _ x ,
s _ x _ x _ _ x x ,
s _ x _ _ x x x x ,
s _ _ x _ _ _ x _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x x _ _ ,// A
s _ _ x _ _ _ x _ ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// B
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x _ ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// C
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ x ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// D
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// E
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x x x x x x _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// F
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// G
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ x x x x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// H
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x x _ _ ,// I
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x x _ _ ,// J
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ x _ _ x _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ x _ _ ,// K
s _ x _ _ x _ _ _ ,
s _ x _ x _ _ _ _ ,
s _ x x _ _ _ _ _ ,
s _ x _ x _ _ _ _ ,
s _ x _ _ x _ _ _ ,
s _ x _ _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ _ ,// L
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// M
s _ x x _ _ _ x x ,
s _ x _ x _ x _ x ,
s _ x _ _ x _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// N
s _ x x _ _ _ _ x ,
s _ x _ x _ _ _ x ,
s _ x _ _ x _ _ x ,
s _ x _ _ _ x _ x ,
s _ x _ _ _ _ x x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// O
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// P
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// Q
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ x _ x ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ x ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// R
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x _ ,
s _ x _ _ _ x _ _ ,
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// S
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ _ ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// T
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// U
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// V
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ x _ _ _ x _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// W
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ x _ _ x ,
s _ x _ x _ x _ x ,
s _ x x _ _ _ x x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// x
s _ _ x _ _ _ x _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ x _ _ _ x _ ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// Y
s _ _ x _ _ _ x _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Z
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x _ _ _ ,// [
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ x _ _ ,// Åè
s _ _ x _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ x _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x _ _ _ ,// ]
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// ^
s _ _ x _ x _ _ _ ,
s _ x _ _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// _
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// RESERVED
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// a
s _ _ _ _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ x x x x _ _ ,
s _ x _ _ _ x _ _ ,
s _ _ x x x _ x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// b
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// c
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ x _ _ ,// d
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// e
s _ _ _ _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ x _ _ _ x _ _ ,
s _ x x x x x _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// f
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// g
s _ _ _ _ _ _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// h
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// i
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// j
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// k
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// l
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// m
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x x x x _ _ _ ,
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// n
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// o
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ x _ _ x _ _ _ ,
s _ x _ _ x _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// p
s _ _ x x x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// q
s _ _ _ x x x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// r
s _ _ _ _ _ _ _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// s
s _ _ _ _ _ _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// t
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// u
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// v
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x _ _ _ x _ ,
s _ _ x _ _ _ x _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// w
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x _ _ _ x _ _ ,
s _ x _ _ _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// x
s _ _ _ _ _ _ _ _ ,
s _ x _ _ _ x _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ x _ _ _ ,
s _ x _ _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// y
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// z
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x _ _ _ ,// {
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// |
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x _ _ _ ,// }
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ~
s _ _ _ x _ x _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// RESERVED
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Ñü
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Ñ†
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Ñ°
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ x x x x x ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Ñ¢
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s x x x x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Ñ£
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s x x x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Ñ§
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x x x x x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Ñ•
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x x x x x ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Ñ¶
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s x x x x x x x x ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Ñß
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s x x x x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Ñ®
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Ñ©
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s x x x x x x x x ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,

s _ _ x x x x _ _ ,// Åõ
s _ x _ _ _ _ x _ ,
s x _ _ _ _ _ _ x ,
s x _ _ _ _ _ _ x ,
s x _ _ _ _ _ _ x ,
s x _ _ _ _ _ _ x ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ _ ,

s _ _ x x x x _ _ ,// Åú
s _ x x x x x x _ ,
s x x x x x x x x ,
s x x x x x x x x ,
s x x x x x x x x ,
s x x x x x x x x ,
s _ x x x x x x _ ,
s _ _ x x x x _ _ ,

s _ _ _ x _ _ _ _ ,// Å}
s _ _ _ x _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Åû
s _ _ x _ x _ _ _ ,
s _ x _ _ _ x _ _ ,
s x _ _ _ _ _ x _ ,
s _ x _ _ _ x _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Åü
s _ _ x x x _ _ _ ,
s _ x x x x x _ _ ,
s x x x x x x x _ ,
s _ x x x x x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x x x ,// Å†
s x _ _ _ _ _ _ x ,
s x _ _ _ _ _ _ x ,
s x _ _ _ _ _ _ x ,
s x _ _ _ _ _ _ x ,
s x _ _ _ _ _ _ x ,
s x _ _ _ _ _ _ x ,
s x x x x x x x x ,

s x x x x x x x x ,// Å°
s x x x x x x x x ,
s x x x x x x x x ,
s x x x x x x x x ,
s x x x x x x x x ,
s x x x x x x x x ,
s x x x x x x x x ,
s x x x x x x x x ,

s _ x _ _ x _ _ x ,// Å¶
s _ _ x _ _ _ x _ ,
s _ _ _ x _ x _ _ ,
s _ x _ _ x _ _ x ,
s _ _ _ x _ x _ _ ,
s _ _ x _ _ _ x _ ,
s _ x _ _ x _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Åß
s _ _ _ _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x x ,// Å„
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s x _ x _ _ _ _ _ ,
s _ x x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// ÅÙ
s _ _ _ x x _ _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ x x _ _ _ _ ,
s _ x x x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ x ,// Å⁄
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Å~
s _ _ x _ _ _ x _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ x _ _ _ x _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÅÄ
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ x x ,// AC
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ x x x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ x _ x _ _ x x ,
s _ _ _ _ _ _ _ _ ,

s _ x x _ _ _ x x ,// DC
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ x x _ _ _ x x ,
s _ _ _ _ _ _ _ _ ,

s x _ _ x _ _ _ _ ,// No
s x x _ x _ _ _ _ ,
s x x _ x _ _ _ _ ,
s x _ x x _ x x x ,
s x _ x x _ x _ x ,
s x _ _ x _ x _ x ,
s x _ _ x _ x x x ,
s _ _ _ _ _ _ _ _ ,

s x x x _ _ _ _ x ,// TEL
s _ x _ _ _ _ _ x ,
s _ x _ _ x _ _ x ,
s _ x _ x _ x _ x ,
s _ x _ x x x _ x ,
s _ x _ x _ _ _ x ,
s _ x _ _ x x _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x x _ _ ,// (!)
s _ _ x x _ x x _ ,
s _ x x x _ x x x ,
s _ x x x _ x x x ,
s _ x x x _ x x x ,
s _ x x x x x x x ,
s _ _ x x _ x x _ ,
s _ _ _ x x x _ _ ,

s _ _ _ _ _ _ _ _ ,//ÅEÅEÅE
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x _ x _ x _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x _ _ ,// (C)
s _ x _ _ _ _ x _ ,
s x _ _ x x _ _ x ,
s x _ x _ _ _ _ x ,
s x _ x _ _ _ _ x ,
s x _ _ x x _ _ x ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ _ ,

s _ _ x _ _ _ _ _ ,// ÉtÉâÉbÉg
s _ _ x _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÅB
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x x _ _ ,// Åu
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Åv
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÅA
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÅE
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Éí
s _ _ _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// É@
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x x x _ ,
s _ _ _ _ x _ x _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÉC
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ x x _ _ ,
s _ x x x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÉD
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ x x x x x _ _ ,
s _ x _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÉF
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÉH
s _ _ _ _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ x _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÉÉ
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÉÖ
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ?
s _ _ _ _ _ _ _ _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ x x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Éb
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x _ x _ x _ _ ,
s _ x _ x _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Å[
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ x x x x x x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// ÉA
s _ _ _ _ _ _ _ x ,
s _ _ _ _ x _ _ x ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ x ,// ÉC
s _ _ _ _ _ x x _ ,
s _ _ _ x x _ _ _ ,
s _ x x _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// ÉE
s _ x x x x x x x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// ÉG
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ x _ ,// ÉI
s _ x x x x x x x ,
s _ _ _ _ _ x x _ ,
s _ _ _ _ x _ x _ ,
s _ _ _ x _ _ x _ ,
s _ _ x _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// ÉJ
s _ x x x x x x x ,
s _ _ _ x _ _ _ x ,
s _ _ _ x _ _ _ x ,
s _ _ _ x _ _ _ x ,
s _ _ x _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// ÉL
s _ x x x x x x _ ,
s _ _ _ _ x _ _ _ ,
s _ x x x x x x _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x x ,// ÉN
s _ _ x _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ _ _ ,// ÉP
s _ _ x x x x x x ,
s _ x _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// ÉR
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ x _ ,// ÉT
s _ x x x x x x x ,
s _ _ x _ _ _ x _ ,
s _ _ x _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x _ _ _ x ,// ÉV
s _ _ _ _ _ _ _ x ,
s _ x x x _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ x x _ _ ,
s _ x x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Éx
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ x _ _ _ x _ ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ _ _ ,// ÉZ
s _ x x x x x x x ,
s _ _ x _ _ _ _ x ,
s _ _ x _ _ _ x _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ x ,// ÅuÇªÅv
s _ _ x _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x x ,// É^
s _ _ x _ _ _ _ x ,
s _ _ x _ _ _ _ x ,
s _ x _ x x x x x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// É`
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Éc
s _ x _ _ x _ _ x ,
s _ _ x _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ x x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Ée
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ _ ,// Ég
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x x x _ _ _ _ ,
s _ x _ _ x x _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// Éi
s _ x x x x x x x ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// Éj
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ x x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Ék
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ x _ _ ,
s _ x x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// Él
s _ x x x x x x x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ x x x _ _ ,
s _ _ x _ x _ x _ ,
s _ x _ _ x _ _ x ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ x ,// Ém
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ x x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Én
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ x _ ,
s _ _ x _ _ _ x _ ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ _ _ ,// Éq
s _ x _ _ _ _ _ _ ,
s _ x x x x x x _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Ét
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// Éw
s _ _ x _ x _ _ _ ,
s _ x _ _ _ x _ _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// Éz
s _ x x x x x x x ,
s _ _ _ _ x _ _ _ ,
s _ _ x _ x _ x _ ,
s _ x _ _ x _ _ x ,
s _ x _ _ x _ _ x ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// É}
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x _ _ ,// É~
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x x _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// ÉÄ
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ _ x _ ,
s _ x _ _ _ x x _ ,
s _ x x x x _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ x _ ,// ÉÅ
s _ _ _ _ _ _ x _ ,
s _ _ x _ _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ x _ _ ,
s _ x x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// ÉÇ
s _ _ _ x _ _ _ _ ,
s _ x x x x x x _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// ÉÑ
s _ x x x x x x x ,
s _ _ _ x _ _ _ x ,
s _ _ _ x _ _ x _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// ÉÜ
s _ _ x x x x x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Éà
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x _ ,// Éâ
s _ _ _ _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ x x _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x _ _ _ _ x _ ,// Éä
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// Éã
s _ _ x _ x _ _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ x _ x _ _ _ ,
s _ _ x _ x _ _ x ,
s _ _ x _ x _ x _ ,
s _ x _ _ x x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ _ _ ,// Éå
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ x _ _ _ _ x ,
s _ _ x _ _ _ x _ ,
s _ _ x _ x x _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Éç
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// Éè
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x _ _ _ _ ,// Éì
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ _ x ,
s _ _ _ _ _ _ x _ ,
s _ _ _ _ x x _ _ ,
s _ x x x _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ _ _ _ ,// ÅJ
s _ x _ _ x _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ _ _ _ ,// ÅK
s _ x _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// ì˙
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x x x ,// åé
s _ _ x _ _ _ _ x ,
s _ _ x x x x x x ,
s _ _ x _ _ _ _ x ,
s _ _ x x x x x x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// âŒ
s _ x _ _ x _ _ x ,
s _ x _ _ x _ _ x ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ x x _ _ _ x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// êÖ
s _ _ _ _ x _ x x ,
s _ x x x x x _ _ ,
s _ _ x _ x _ x _ ,
s _ x _ _ x _ x _ ,
s _ _ _ _ x _ _ x ,
s _ _ _ x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// ñÿ
s _ x x x x x x x ,
s _ _ _ x x x _ _ ,
s _ _ x _ x _ x _ ,
s _ _ x _ x _ x _ ,
s _ x _ _ x _ _ x ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// ã‡
s _ _ x x x x x _ ,
s _ x _ x x x _ x ,
s _ _ x x x x x _ ,
s _ _ x _ x _ x _ ,
s _ _ x x x x x _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ x _ _ _ ,// ìy
s _ _ _ _ x _ _ _ ,
s _ _ x x x x x _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Ñü
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ x _ _ ,// Ñ†
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,

s _ _ _ _ _ _ _ _ ,// Ñ°
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ x x x x ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ _ x x ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,

s _ _ _ _ _ _ _ _ ,// Ñ¢
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s x x x x x _ _ _ ,
s _ _ _ _ _ x _ _ ,
s x x x _ _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,

s _ _ _ x _ x _ _ ,// Ñ£
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s x x x _ _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s x x x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ x _ _ ,// Ñ§
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ _ x x ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x x x x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ x _ _ ,// Ñ•
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x x x ,
s _ _ _ x _ _ _ _ ,
s _ _ _ x _ x x x ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,

s _ _ _ _ _ _ _ _ ,// Ñ¶
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,
s x x x x _ x x x ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,

s _ _ _ x _ x _ _ ,// Ñß
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s x x x x _ x _ _ ,
s _ _ _ _ _ x _ _ ,
s x x x x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,

s _ _ _ x _ x _ _ ,// Ñ®
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s x x x x _ x x x ,
s _ _ _ _ _ _ _ _ ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x _ x _ _ ,// Ñ©
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,
s x x x x _ x x x ,
s _ _ _ _ _ _ _ _ ,
s x x x x _ x x x ,
s _ _ _ x _ x _ _ ,
s _ _ _ x _ x _ _ ,

s _ _ x _ _ _ _ _ ,// Å®
s _ _ x x _ _ _ _ ,
s _ _ x x x _ _ _ ,
s _ _ x x x x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ x x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ x _ _ ,// Å©
s _ _ _ _ x x _ _ ,
s _ _ _ x x x _ _ ,
s _ _ x x x x _ _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ x x _ _ ,
s _ _ _ _ _ x _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Å´
s _ _ _ _ _ _ _ _ ,
s _ x x x x x x x ,
s _ _ x x x x x _ ,
s _ _ _ x x x _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ _ ,// Å™
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x x x _ _ ,
s _ _ x x x x x _ ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// CHECK BOx CHECKED
s _ x _ _ _ _ _ x ,
s _ x _ x _ x _ x ,
s _ x _ _ x _ _ x ,
s _ x _ x _ x _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x x ,// CHECK BOx UN-CHECKED
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x _ _ _ _ _ x ,
s _ x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ _ _ _ _ x ,// Éø
s _ _ _ x x _ x _ ,
s _ _ x _ _ x x _ ,
s _ x _ _ _ x _ _ ,
s _ x _ _ _ x _ _ ,
s _ x _ _ x _ x _ ,
s _ _ x x _ _ _ x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x _ _ _ ,// É¿
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ x _ _ x _ _ ,
s _ x x _ _ x _ _ ,
s _ _ x x x _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s _ x x x x x x _ ,// É∞
s _ _ x _ _ _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ _ _ x _ _ _ ,
s _ _ _ x _ _ _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x x x x x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x x x x _ _ ,// É∂
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ x _ _ _ _ x _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ x x _ _ x x _ ,
s _ _ _ _ _ _ _ _ ,

s _ _ x _ _ x _ _ ,// É 
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x _ _ x _ _ ,
s _ _ x x x x _ _ ,
s _ _ x _ _ _ _ _ ,
s _ x _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

s x x x x x x x x ,// ENTER
s x _ _ _ _ _ _ x ,
s x _ _ _ _ x _ x ,
s x _ _ x _ x _ x ,
s x _ x x x x _ x ,
s x _ _ _ _ _ _ x ,
s x x x x x x x x ,
s _ _ _ _ _ _ _ _ ,

s _ _ _ x x x _ _ ,// éûåv
s _ _ x _ _ _ x _ ,
s _ x _ _ x _ _ x ,
s _ x _ _ x _ _ x ,
s _ x _ _ x x _ x ,
s _ x _ _ _ _ _ x ,
s _ _ x _ _ _ x _ ,
s _ _ _ x x x _ _ ,

s _ _ x x x x _ _ ,// ÉxÉ}ÉCÉã
s _ x _ _ _ _ x _ ,
s x _ x _ _ x _ x ,
s x _ _ _ _ _ _ x ,
s x _ x _ _ x _ x ,
s x _ _ x x _ _ x ,
s _ x _ _ _ _ x _ ,
s _ _ x x x x _ _ ,

s _ _ _ _ _ _ _ _ ,// SPACE
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,
s _ _ _ _ _ _ _ _ ,

};

#undef s
#undef x
#undef _

