/*-----------------------------------------------
  名称：IIC协议 24c02存储花样灯程序
  论坛：www.doflye.net
  编写：shifang
  修改：无
  内容：将表格内容写入24c02，然后批量删除这些数据，
        并从24c02中读取数据并显示
------------------------------------------------*/  
#include <reg52.h>                
#include "i2c.h"
/*------------------------------------------------
                    花样灯表格
------------------------------------------------*/
unsigned char      dat[]={0x7f,0xbf,0xdf,0xef,
						  0xf7,0xfb,0xfd,0xfe,
						  0xff,0xff,0x00,0x00,
						  0x55,0x55,0xaa,0xaa
						  };//ram允许情况可以无限添加
/*------------------------------------------------
                   主函数
------------------------------------------------*/
main()
{
 //bit flag;
 unsigned char i;
 ISendStr(0xae,80,dat,16);            //写入24c02
 DelayMs(1);                          //写入后必须延时等待24c02内部
                                      //烧录数据处理完毕方可继续其他操作
 for(i=0;i<16;i++)                    //清除数据
     dat[i]=0;
 IRcvStr(0xae,80,dat,16);             //从24c02读出数据 
 while(1)
     {

	   for(i=0;i<16;i++)              //查表
	     {
		 DelayMs(200);
         P1=dat[i];
		 }
	 }
}
