/*-----------------------------------------------
  名称：定时器0 
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：通过定时产生200mS方波 
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义

sbit OUT=P1^2;    //定义OUT输出端口

/*------------------------------------------------
                    定时器初始化子程序
------------------------------------------------*/
void Init_Timer0(void)
{
 TMOD |= 0x01;	  //使用模式1，16位定时器，使用"|"符号可以在使用多个定时器时不受影响		     
 //TH0=0x00;	      //给定初值，这里使用定时器最大值从0开始计数一直到65535溢出
 //TL0=0x00;
 EA=1;            //总中断打开
 ET0=1;           //定时器中断打开
 TR0=1;           //定时器开关打开
}
/*------------------------------------------------
                    主程序
------------------------------------------------*/
main()
{
 Init_Timer0();
 while(1);
}

/*------------------------------------------------
                 定时器中断子程序
------------------------------------------------*/
void Timer0_isr(void) interrupt 1 using 1
{
 static unsigned char i;
 TH0=(65536-10000)/256;		  //重新赋值 12M晶振计算，指令周期1uS，
                              //200mS方波半个周期100mS，由于定时器
                              //最大值65536 即65.536ms 所以
 TL0=(65536-10000)%256;       //直接定时器不够用，需要用循环处理,
                              //定时10ms，然后循环10次后输出 10x10=100ms

 i++;
 if(i==11)
 {
   i=0;
   OUT=~OUT;        //用示波器可看到方波输出 
  }

}