/*-----------------------------------------------
  名称：从红外接收读取电平信息
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：从红外接收头接收到信息反映到LED上
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义

sbit LED=P1^0;// 用sbit 关键字 定义 LED到P1.0端口，LED是自己任意定义且容易记忆的符号

sbit IR_IN=P3^2;
/*------------------------------------------------
                    主函数
------------------------------------------------*/
void main (void)
{
                

while (1)         //主循环
  {
  LED=IR_IN;//主循环中添加其他需要一直工作的程序
  }
}