/*-----------------------------------------------
  名称：定时器2
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：通过定时让LED灯闪烁
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义

sbit LED=P1^0;    //定义LED端口


/*------------------------------------------------
                    定时器初始化子程序
------------------------------------------------*/
void TIM2Inital(void)
{
  RCAP2H = (65536-60000)/256;//晶振12M 60ms 16bit 自动重载
  RCAP2L = (65536-60000)%256;
  ET2=1;                     //打开定时器中断
  EA=1;                      //打开总中断
  TR2=1;                     //打开定时器开关
}
/*------------------------------------------------
                    主程序
------------------------------------------------*/
main()
{
 TIM2Inital();
 while(1);
}

/*------------------------------------------------
                 定时器中断子程序
------------------------------------------------*/
void TIM2(void) interrupt 5 using 1//定时器2中断
{

    TF2=0;
    LED=~LED;               //指示灯反相
   
}
