/*-----------------------------------------------
  名称：舵机控制	
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：通过按键调整舵机角度，舵机参数： 20ms周期，高电平时间从0.5ms~2.5ms,最大范围，根据不同舵机调整
------------------------------------------------*/
#include<reg52.h>
#include "delay.h"

sbit OUT = P0^0;

sbit KEY1=P3^0;  //定义按键输入端口
sbit KEY2=P3^1;
sbit KEY3=P3^2;
sbit KEY4=P3^3;
sbit KEY5=P3^4;
sbit KEY6=P3^5;
sbit KEY7=P3^6;
sbit KEY8=P3^7;

unsigned char TH_H,TL_H,TH_L,TL_L;//

unsigned char KeyScan(void);
/*------------------------------------------------
                    定时器初始化子程序
------------------------------------------------*/
void Init_Timer0(void)
{
 TMOD |= 0x01;	  //使用模式1，16位定时器，使用"|"符号可以在使用多个定时器时不受影响	TOMD = TOMD | 0X01	     
 TH0=0x00;	      //给定初值，这里使用定时器最大值从0开始计数一直到65535溢出
 TL0=0x00;
 EA=1;            //总中断打开
 ET0=1;           //定时器中断打开
 TR0=1;           //定时器开关打开
}
/*------------------------------------------------
                 数据处理
------------------------------------------------*/
void DataPro(unsigned int temp)
{
 	 TH_H=(65536-temp)/256;
     TL_H=(65536-temp)%256;
	 TH_L=(46536+temp)/256;
	 TL_L=(46536+temp)%256;
}
/*------------------------------------------------
                 主程序
------------------------------------------------*/
main()
{
  unsigned char keynum;
  unsigned int  temp=1500;
  Init_Timer0();
  DataPro(temp);

  while(1)
     {
	  keynum=KeyScan();
	  if(keynum==3)
	    {
		 if(temp<2300)
		   temp+=100;
         DataPro(temp);
		}
	  else if(keynum==4)
	   {
	     if(temp>600)
		   temp-=100;
		 DataPro(temp);
	   }
	 }
}

/*------------------------------------------------
                 定时器中断子程序
------------------------------------------------*/
void Timer0_isr(void) interrupt 1
{
if(OUT)
 {
 TH0=TH_L;		  //重新赋值
 TL0=TL_L;
 }
else
 {
  TH0=TH_H;		  //重新赋值
  TL0=TL_H;
  }
OUT=!OUT;
}

/*------------------------------------------------
            按键扫描函数，返回扫描键值
------------------------------------------------*/
unsigned char KeyScan(void)
{
/********************************************************/  
if(!KEY1)  //如果检测到低电平，说明按键按下
    {
	 DelayMs(10); //延时去抖，一般10-20ms
     if(!KEY1)     //再次确认按键是否按下，没有按下则退出
	   {
        while(!KEY1);//如果确认按下按键等待按键释放，没有则退出
	       {
		   return 1;
	 		}
	   }
	}
/********************************************************/  
else if(!KEY2)  //如果检测到低电平，说明按键按下
    {
	 DelayMs(10); //延时去抖，一般10-20ms
     if(!KEY2)     //再次确认按键是否按下，没有按下则退出
	   {
        while(!KEY2);//如果确认按下按键等待按键释放，没有则退出
	       {
		   return 2;
	 		}
	   }
	}
/********************************************************/  
else if(!KEY3)  //如果检测到低电平，说明按键按下
    {
	 DelayMs(10); //延时去抖，一般10-20ms
     if(!KEY3)     //再次确认按键是否按下，没有按下则退出
	   {
        while(!KEY3);//如果确认按下按键等待按键释放，没有则退出
	       {
		   return 3;
	 		}
	   }
	}
/********************************************************/  
else if(!KEY4)  //如果检测到低电平，说明按键按下
    {
	 DelayMs(10); //延时去抖，一般10-20ms
     if(!KEY4)     //再次确认按键是否按下，没有按下则退出
	   {
        while(!KEY4);//如果确认按下按键等待按键释放，没有则退出
	       {
		   return 4;
	 		}
	   }
	}
/********************************************************/  
else if(!KEY5)  //如果检测到低电平，说明按键按下
    {
	 DelayMs(10); //延时去抖，一般10-20ms
     if(!KEY5)     //再次确认按键是否按下，没有按下则退出
	   {
        while(!KEY5);//如果确认按下按键等待按键释放，没有则退出
	       {
		   return 5;
	 		}
	   }
	}
/********************************************************/  
else if(!KEY6)  //如果检测到低电平，说明按键按下
    {
	 DelayMs(10); //延时去抖，一般10-20ms
     if(!KEY6)     //再次确认按键是否按下，没有按下则退出
	   {
        while(!KEY6);//如果确认按下按键等待按键释放，没有则退出
	       {
		   return 6;
	 		}
	   }
	}
/********************************************************/  
else if(!KEY7)  //如果检测到低电平，说明按键按下
    {
	 DelayMs(10); //延时去抖，一般10-20ms
     if(!KEY7)     //再次确认按键是否按下，没有按下则退出
	   {
        while(!KEY7);//如果确认按下按键等待按键释放，没有则退出
	       {
		   return 7;
	 		}
	   }
	}
/********************************************************/  
else if(!KEY8)  //如果检测到低电平，说明按键按下
    {
	 DelayMs(10); //延时去抖，一般10-20ms
     if(!KEY8)     //再次确认按键是否按下，没有按下则退出
	   {
        while(!KEY8);//如果确认按下按键等待按键释放，没有则退出
	       {
		   return 8;
	 		}
	   }
	}
/********************************************************/  
else
    return 0;
}

