;*******************************Copyright (c)********************************
;**                 广州周立功单片机发展有限公司研究所
;**                        http://www.zlgmcu.com
;********************************文件信息*************************************
;文件名：Buzz.asm
;功能：使用DP－51h实验仪学习I/O作基本输出口并及其仿真调试程序的基本方法
;说明:
;正确设置跳线JP4使P1.3与BUZZ相连，即把跳线置于上端
;最后修改时间:2003年6月12
;*************************************************************************
		ORG	8000H			;伪指令，指定程序从8000H开始存放
		AJMP	MAIN			;跳转指令，程序跳转到MAIN处

		ORG	8100H			;伪指令，指定以下程序从8100H开始存放
MAIN:
		MOV	SP,#60			;给堆栈指针赋初值
LOOP:		ACALL	MUSIC
		AJMP	LOOP


;***********************
;蜂鸣器输出声响子程序
;**********************
MUSIC:
		MOV	R5,#60H			;控制音长
MIC:
		CPL	P1.3
		ACALL	DELAY5MS		;控制音调
		DJNZ	R5,MIC
		RET


;***************
;延时子程序
;***************
DELAY5MS:
		MOV	R7,#3H
DELAY0:		MOV	R6,#40H
DELAY1:		DJNZ	R6,DELAY1
		DJNZ	R7,DELAY0
		RET
		;
		END

