/*******************************************************************************
*  数码管显示（译码器位选 共阴极）                                             *
********************************************************************************/

#include <reg51.h> 


void delay(unsigned int i);      //函数声名

char DelayCNT;
 
//此表为 LED 的字模, 共阴数码管   0-9  - 
unsigned char code Disp_Tab[] = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x40}; 

/************主函数**********************/ 
main()
{  
   unsigned int i;

  while(1)  //进入循环状态
  {	 
	
	 for( i=0; i<10; i++)  //实现8位动态扫描循环
	 {	 
	  P1 = Disp_Tab[i];  //将字模送到P0口显示
	  delay(30000);
	 }
	 
  }   
}	

/***************************************************************************
*																		   *
*		                    延时程序						               *
****************************************************************************/
void delay(unsigned int i)
{
    char j;
    for(i; i > 0; i--)
        for(j = 200; j > 0; j--);
}


