/*-----------------------------------------------
  名称：非门数字芯片测试
  论坛：www.doflye.net
  编写：shifang
  日期：2009.5
  修改：无
  内容：通过电闪烁P1口状态，观测非门工作状态
        主要测试非门功能和检验芯片是否正常工作
------------------------------------------------*/
#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义
/*------------------------------------------------
 uS延时函数，含有输入参数 unsigned char t，无返回值
 unsigned char 是定义无符号字符变量，其值的范围是
 0~255 这里使用晶振12M，精确延时请使用汇编,大致延时
 长度如下 T=tx2+5 uS 
------------------------------------------------*/
void DelayUs2x(unsigned char t)
{   
 while(--t);
}
/*------------------------------------------------
 mS延时函数，含有输入参数 unsigned char t，无返回值
 unsigned char 是定义无符号字符变量，其值的范围是
 0~255 这里使用晶振12M，精确延时请使用汇编
------------------------------------------------*/
void DelayMs(unsigned char t)
{
     
 while(t--)
 {
     //大致延时1mS
     DelayUs2x(245);
	 DelayUs2x(245);
 }
}

/*------------------------------------------------
                    主函数
------------------------------------------------*/
void main (void)
{
P1=0x00;          //初始化值
while (1)         //主循环
  {
   DelayMs(200);  //主循环中添加其他需要一直工作的程序
   DelayMs(200);  //延时后进行端口取反操作，用led看到的效果是闪烁
   P1=~P1;        
  }
}